Kyle Timmermans (Rose Hill) - Prof. Mao - Lab 3 - 11/04/20

In [143]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

Connect to lab3.db3

In [144]:
%sql sqlite:///lab3.db3

'Connected: @lab3.db3'

Display sno and grade using scores with BETWEEN keyword

In [145]:
%sql select sno, grade from scores where grade BETWEEN 70 and 90;

 * sqlite:///lab3.db3
Done.

[('103', 86),
 ('105', 75),
 ('105', 88),
 ('109', 76),
 ('108', 78),
 ('101', 85),
 ('107', 79),
 ('108', 81)]

Use avg() func and students.sno must = scores.sno so we map the students to their test scores

In [146]:
%sql select avg(grade), class from scores, students where students.sno=scores.sno and class=15033;

 * sqlite:///lab3.db3
Done.

[(79.66666666666667, '15033')]

Group students that have at least 2 'M'

In [147]:
%sql select class from students GROUP BY class HAVING COUNT(CASE WHEN sgender = 'M' THEN 1 END) > 1

 * sqlite:///lab3.db3
Done.

[('15031',), ('15033',)]

Show titles that only show up once in both 'CS' and 'EE'

In [148]:
%sql select tname, title FROM teachers where title IN (select title FROM teachers t GROUP BY t.title HAVING COUNT(department)=1);

 * sqlite:///lab3.db3
Done.

[('Dan', 'AP'), ('Frank', 'LE')]

Where grades of course 3-105 are greater than the 3-245 course, use DESC keyword to descend

In [149]:
%sql select cno, sno, grade FROM scores WHERE grade > (SELECT min(grade) FROM scores where cno='3-245') and cno='3-105' ORDER BY grade DESC;

 * sqlite:///lab3.db3
Done.

[('3-105', '103', 92),
 ('3-105', '107', 91),
 ('3-105', '105', 88),
 ('3-105', '108', 78),
 ('3-105', '109', 76)]

All students took more 2 courses, Quincy had highest grade. Therefore, he should not show up

In [187]:
%sql select sname FROM students where sno <> (select sno FROM scores where grade = (select max(grade) FROM scores));

 * sqlite:///lab3.db3
Done.

[('Peter',), ('Gary',), ('Lily',), ('Alex',), ('Eva',)]

Bonus: Where grade is less than average of all grades in particular class

In [170]:
%sql select * FROM scores s where grade < (select avg(grade) FROM scores x where s.cno = x.cno)

 * sqlite:///lab3.db3
Done.

[('105', '3-245', 75),
 ('109', '3-245', 68),
 ('109', '3-105', 76),
 ('101', '3-105', 64),
 ('108', '3-105', 78),
 ('107', '6-166', 79),
 ('108', '6-166', 81)]